# SQL 4 Data Science: Predict Project
## Bhejane Online Trading Store

### Student Starter Notebook

Â© Explore Data Science Academy

### Honour Code

I {**YOUR NAME**, **YOUR SURNAME**}, confirm - by submitting this document - that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

<a id='Context'></a>
### 1. Context

<div align="center" style="width: 600px; font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/Bhejane_large.jpg"
     alt="The Black Rhino"
     style="float: center; padding-bottom=0.5em"
     width=600px/>
     Bhejane, or the Black Rhino. Image by <a href="https://commons.wikimedia.org/wiki/File:Black_Rhino_(Diceros_bicornis)_browsing_..._(46584052962).jpg">Wikimedia Commons</a>
</div>


The Bhejane trading store is an online retailer specialising in Covid essesstial items. The store has recently be struggling with the management of its database-related inventory system. Luckily for them, you've been hired as a consultant to fix the problem. 

Its time to flex your Ninja SQL skills! 
 
**Your mission, should you choose to accept it:**

You will receive a denormalised database consisting of two tables. Your task is to transform the database such that is in third normal form (3NF). To ensure that a consistent normalisation process is followed by each student, we have attached an Entity Relationship Diagram (ERD) which is a guideline on what tables need to be produced. Once you have normalised the databasse, you will be required to complete an MCQ test found under the 'Predict' tab of Athena.

<a id='Imports'></a>
### 2. Imports
Please use the below command to install sql_magic, this is the package that will assist you with SQL syntax hightlighting.
* pip install sql_magic

Remember to start each new cell with " %%read_sql "

In [1]:
pip install sql_magic

Requirement already satisfied: sql_magic in c:\users\bonol\anaconda3\lib\site-packages (0.0.4)
Requirement already satisfied: findspark in c:\users\bonol\anaconda3\lib\site-packages (from sql_magic) (1.4.2)
Requirement already satisfied: jupyter in c:\users\bonol\anaconda3\lib\site-packages (from sql_magic) (1.0.0)
Requirement already satisfied: ipython in c:\users\bonol\anaconda3\lib\site-packages (from sql_magic) (7.19.0)
Requirement already satisfied: traitlets in c:\users\bonol\anaconda3\lib\site-packages (from sql_magic) (5.0.5)
Requirement already satisfied: sqlparse in c:\users\bonol\anaconda3\lib\site-packages (from sql_magic) (0.4.1)
Requirement already satisfied: pandas in c:\users\bonol\anaconda3\lib\site-packages (from sql_magic) (1.1.3)
Requirement already satisfied: ipywidgets in c:\users\bonol\anaconda3\lib\site-packages (from jupyter->sql_magic) (7.5.1)
Requirement already satisfied: ipykernel in c:\users\bonol\anaconda3\lib\site-packages (from jupyter->sql_magic) (5.5.0)
Requirement already satisfied: notebook in c:\users\bonol\anaconda3\lib\site-packages (from jupyter->sql_magic) (6.1.4)
Requirement already satisfied: qtconsole in c:\users\bonol\anaconda3\lib\site-packages (from jupyter->sql_magic) (4.7.7)
Requirement already satisfied: nbconvert in c:\users\bonol\anaconda3\lib\site-packages (from jupyter->sql_magic) (6.0.7)
Requirement already satisfied: jupyter-console in c:\users\bonol\anaconda3\lib\site-packages (from jupyter->sql_magic) (6.2.0)
Requirement already satisfied: decorator in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (4.4.2)
Requirement already satisfied: jedi>=0.10 in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (0.17.1)
Requirement already satisfied: backcall in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (3.0.8)
Requirement already satisfied: pickleshare in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (50.3.1.post20201107)
Requirement already satisfied: pygments in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (2.7.2)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\users\bonol\anaconda3\lib\site-packages (from ipython->sql_magic) (0.4.4)
Requirement already satisfied: ipython-genutils in c:\users\bonol\anaconda3\lib\site-packages (from traitlets->sql_magic) (0.2.0)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\bonol\anaconda3\lib\site-packages (from pandas->sql_magic) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\bonol\anaconda3\lib\site-packages (from pandas->sql_magic) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in c:\users\bonol\anaconda3\lib\site-packages (from pandas->sql_magic) (2020.1)
Requirement already satisfied: nbformat>=4.2.0 in c:\users\bonol\anaconda3\lib\site-packages (from ipywidgets->jupyter->sql_magic) (5.0.8)
Requirement already satisfied: widgetsnbextension~=3.5.0 in c:\users\bonol\anaconda3\lib\site-packages (from ipywidgets->jupyter->sql_magic) (3.5.1)
Requirement already satisfied: jupyter-client in c:\users\bonol\anaconda3\lib\site-packages (from ipykernel->jupyter->sql_magic) (6.1.7)
Requirement already satisfied: tornado>=4.2 in c:\users\bonol\anaconda3\lib\site-packages (from ipykernel->jupyter->sql_magic) (6.0.4)
Requirement already satisfied: prometheus-client in c:\users\bonol\anaconda3\lib\site-packages (from notebook->jupyter->sql_magic) (0.8.0)
Requirement already satisfied: terminado>=0.8.3 in c:\users\bonol\anaconda3\lib\site-packages (from notebook->jupyter->sql_magic) (0.9.1)
Requirement already satisfied: Send2Trash in c:\users\bonol\anaconda3\lib\site-packages (from notebook->jupyter->sql_magic) (1.5.0)
Requirement already satisfied: jupyter-core>=4.6.1 in c:\users\bonol\anaconda3\lib\site-packages (from notebook->jupyter->sql_magic) (4.6.3)
Requirement already satisfied: jinja2 in c:\users\bonol\anaconda3\lib\site-packages (from notebook->jupyter->sql_magic) (2.11.2)
Requirement already satisfied: pyzmq>=17 in c:\users\bonol\anaconda3\lib\site-packages (from notebook->jupyter->sql_magic) (19.0.2)
Requirement already satisfied: argon2-cffi in c:\users\bonol\anaconda3\lib\site-packages (from notebook->jupyter->sql_magic) (20.1.0)
Requirement already satisfied: qtpy in c:\users\bonol\anaconda3\lib\site-packages (from qtconsole->jupyter->sql_magic) (1.9.0)
Requirement already satisfied: mistune<2,>=0.8.1 in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (0.8.4)
Requirement already satisfied: entrypoints>=0.2.2 in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (0.3)
Requirement already satisfied: jupyterlab-pygments in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (0.1.2)
Requirement already satisfied: bleach in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (3.2.1)
Requirement already satisfied: pandocfilters>=1.4.1 in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (1.4.3)
Requirement already satisfied: defusedxml in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (0.6.0)
Requirement already satisfied: nbclient<0.6.0,>=0.5.0 in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied: testpath in c:\users\bonol\anaconda3\lib\site-packages (from nbconvert->jupyter->sql_magic) (0.4.4)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\bonol\anaconda3\lib\site-packages (from jedi>=0.10->ipython->sql_magic) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\bonol\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython->sql_magic) (0.2.5)
Requirement already satisfied: six>=1.5 in c:\users\bonol\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas->sql_magic) (1.15.0)
Requirement already satisfied: jsonschema!=2.5.0,>=2.4 in c:\users\bonol\anaconda3\lib\site-packages (from nbformat>=4.2.0->ipywidgets->jupyter->sql_magic) (3.2.0)
Requirement already satisfied: pywinpty>=0.5 in c:\users\bonol\anaconda3\lib\site-packages (from terminado>=0.8.3->notebook->jupyter->sql_magic) (0.5.7)Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pywin32>=1.0; sys_platform == "win32" in c:\users\bonol\anaconda3\lib\site-packages (from jupyter-core>=4.6.1->notebook->jupyter->sql_magic) (227)
Requirement already satisfied: MarkupSafe>=0.23 in c:\users\bonol\anaconda3\lib\site-packages (from jinja2->notebook->jupyter->sql_magic) (1.1.1)
Requirement already satisfied: cffi>=1.0.0 in c:\users\bonol\anaconda3\lib\site-packages (from argon2-cffi->notebook->jupyter->sql_magic) (1.14.3)
Requirement already satisfied: packaging in c:\users\bonol\anaconda3\lib\site-packages (from bleach->nbconvert->jupyter->sql_magic) (20.4)
Requirement already satisfied: webencodings in c:\users\bonol\anaconda3\lib\site-packages (from bleach->nbconvert->jupyter->sql_magic) (0.5.1)
Requirement already satisfied: nest-asyncio in c:\users\bonol\anaconda3\lib\site-packages (from nbclient<0.6.0,>=0.5.0->nbconvert->jupyter->sql_magic) (1.4.2)
Requirement already satisfied: async-generator in c:\users\bonol\anaconda3\lib\site-packages (from nbclient<0.6.0,>=0.5.0->nbconvert->jupyter->sql_magic) (1.10)
Requirement already satisfied: pyrsistent>=0.14.0 in c:\users\bonol\anaconda3\lib\site-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.2.0->ipywidgets->jupyter->sql_magic) (0.17.3)
Requirement already satisfied: attrs>=17.4.0 in c:\users\bonol\anaconda3\lib\site-packages (from jsonschema!=2.5.0,>=2.4->nbformat>=4.2.0->ipywidgets->jupyter->sql_magic) (20.3.0)
Requirement already satisfied: pycparser in c:\users\bonol\anaconda3\lib\site-packages (from cffi>=1.0.0->argon2-cffi->notebook->jupyter->sql_magic) (2.20)
Requirement already satisfied: pyparsing>=2.0.2 in c:\users\bonol\anaconda3\lib\site-packages (from packaging->bleach->nbconvert->jupyter->sql_magic) (2.4.7)

In [3]:
pip install --upgrade ipykernel

Requirement already up-to-date: ipykernel in c:\users\bonol\anaconda3\lib\site-packages (5.5.0)
Requirement already satisfied, skipping upgrade: ipython>=5.0.0 in c:\users\bonol\anaconda3\lib\site-packages (from ipykernel) (7.19.0)
Requirement already satisfied, skipping upgrade: traitlets>=4.1.0 in c:\users\bonol\anaconda3\lib\site-packages (from ipykernel) (5.0.5)
Requirement already satisfied, skipping upgrade: tornado>=4.2 in c:\users\bonol\anaconda3\lib\site-packages (from ipykernel) (6.0.4)
Requirement already satisfied, skipping upgrade: jupyter-client in c:\users\bonol\anaconda3\lib\site-packages (from ipykernel) (6.1.7)
Requirement already satisfied, skipping upgrade: colorama; sys_platform == "win32" in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (0.4.4)
Requirement already satisfied, skipping upgrade: jedi>=0.10 in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (0.17.1)
Requirement already satisfied, skipping upgrade: pickleshare in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (0.7.5)
Requirement already satisfied, skipping upgrade: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (3.0.8)
Requirement already satisfied, skipping upgrade: pygments in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (2.7.2)
Requirement already satisfied, skipping upgrade: setuptools>=18.5 in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (50.3.1.post20201107)
Requirement already satisfied, skipping upgrade: backcall in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (0.2.0)
Requirement already satisfied, skipping upgrade: decorator in c:\users\bonol\anaconda3\lib\site-packages (from ipython>=5.0.0->ipykernel) (4.4.2)
Requirement already satisfied, skipping upgrade: ipython-genutils in c:\users\bonol\anaconda3\lib\site-packages (from traitlets>=4.1.0->ipykernel) (0.2.0)
Requirement already satisfied, skipping upgrade: python-dateutil>=2.1 in c:\users\bonol\anaconda3\lib\site-packages (from jupyter-client->ipykernel) (2.8.1)
Requirement already satisfied, skipping upgrade: jupyter-core>=4.6.0 in c:\users\bonol\anaconda3\lib\site-packages (from jupyter-client->ipykernel) (4.6.3)
Requirement already satisfied, skipping upgrade: pyzmq>=13 in c:\users\bonol\anaconda3\lib\site-packages (from jupyter-client->ipykernel) (19.0.2)
Requirement already satisfied, skipping upgrade: parso<0.8.0,>=0.7.0 in c:\users\bonol\anaconda3\lib\site-packages (from jedi>=0.10->ipython>=5.0.0->ipykernel) (0.7.0)
Requirement already satisfied, skipping upgrade: wcwidth in c:\users\bonol\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=5.0.0->ipykernel) (0.2.5)
Requirement already satisfied, skipping upgrade: six>=1.5 in c:\users\bonol\anaconda3\lib\site-packages (from python-dateutil>=2.1->jupyter-client->ipykernel) (1.15.0)
Requirement already satisfied, skipping upgrade: pywin32>=1.0; sys_platform == "win32" in c:\users\bonol\anaconda3\lib\site-packages (from jupyter-core>=4.6.0->jupyter-client->ipykernel) (227)
Note: you may need to restart the kernel to use updated packages.

In [1]:
# DO NOT EDIT THIS CELL
import sqlite3
import csv
from sqlalchemy import create_engine
%load_ext sql_magic

# Load SQLite database
engine  = create_engine("sqlite:///bhejane.db")
%config SQL.conn_name ='engine'

<a id='Data_description'></a>
### 3. Data description

The original database consist of 2 tables. 
* Product Table
* Transaction Table

In [2]:
# DO NOT EDIT THIS CELL
import pandas as pd
data_description = pd.read_excel('Data Description.xlsx')
data_description

,Table Name,Column Name,Desciption
0,Products,Width,Width of the product once assembled
1,Products,Length,Length of the product once assembled
2,Products,Height,Height of the product once assembled
3,Products,Barcode,The unique product identifier
4,Products,Quantity,Number of goods in stock
5,Products,Brand,Product brand name relating to product company
6,Products,NavigationPath,Navigation path to specific product
7,Products,Colour,Name default colour for the product
8,Products,StockCountry,Country where the stock was bought from
9,Products,ProductDescription,Descriptive product name
10,Products,PackType,The way in which the product is packaged
11,Products,Volume_litre,The quantity of liquid based products
12,Products,Warranty,Product warranty type
13,Products,Weight_kg,Weight of the product
14,Products,ItemDescription,Description of contents of the package
15,Products,Price,The cost of the product in Rands
16,Transactions,CartID,Identifies an individual basket from a user pu...
17,Transactions,Barcode,Barcode for item that user purchased
18,Transactions,Total,Total value of a transaction
19,Transactions,UserName,Name of customer purchasing stock
20,Transactions,InvoiceDate,Date on which the product was bought

<a id='Setting_up'></a>
### 4. Setting up the database

In [3]:
#DO NOT EDIT THIS CELL
conn = sqlite3.connect('bhejane.db')
cursor = conn.cursor()

#### Creating both Products and Transaction Tables

In [4]:
%%read_sql
--DO NOT EDIT THIS CELL
DROP TABLE IF EXISTS "Products";
DROP TABLE IF EXISTS "Transactions";

CREATE TABLE "Products" (
    "Width"   REAL,
    "Length"  REAL,
    "Height"  REAL,
    "Barcode" VARCHAR(150) NOT NULL,
    "Quantity" INTEGER NOT NULL,
    "Brand" VARCHAR(150), 
    "NavigationPath" VARCHAR(150),
    "Colour" VARCHAR(150),
    "StockCountry" VARCHAR(150),
    "ProductDescription" VARCHAR(150) NOT NULL,
    "PackType" VARCHAR(150), 
    "Volume_litre" REAL, 
    "Warranty" VARCHAR(150), 
    "Weight_kg" REAL,
    "ItemDescription" VARCHAR(150), 
    "Price" REAL
);


CREATE TABLE "Transactions" (
    "CartID" INTEGER,
    "Barcode" VARCHAR(150), 
    "Total" REAL,
    "UserName" VARCHAR(150), 
    "InvoiceDate" DATETIME
);

Query started at 10:33:26 AM South Africa Standard Time; Query executed in 0.00 m

#### Load Data into Product and Transaction tables

In [5]:
# DO NOT EDIT CELL
# Load data into Product table
with open('bhejane_covid_essentials_Products.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['Width'],i['Length'],i['Height'], i['Barcode'], i['Quantity'], i['Brand'], i['NavigationPath'], i['Colour'], i['StockCountry'], i['ProductDescription'],i['PackType'],i['Volume_litre'],i['Warranty'],i['Weight_kg'],i["ItemDescription"],i['Price']) for i in dr]

cursor.executemany("INSERT INTO Products VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?);", to_db)
conn.commit()

with open('bhejane_covid_essentials_Transactions.csv','r') as fin: # `with` statement available in 2.5+
    # csv.DictReader uses first line in file for column headings by default
    dr = csv.DictReader(fin) # comma is default delimiter
    to_db = [(i['CartID'],i['Barcode'], i['Total'], i['UserName'], i['InvoiceDate']) for i in dr]

cursor.executemany("INSERT INTO Transactions VALUES (?, ?, ?, ?, ?);", to_db)
conn.commit()

<a id='ERD'></a>
### 5. Denormalized Database Tables


<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/Denormalized_Tables.png" alt="Denormalized Tables" border="0">

#### 5.1 Explore the Denormalized Tables
Familiarize yourself with the data given in the two tables by writing your own SQL queries to explore properties of the dataset.i.e Look for data inconsistencies, anormalies, redundancies etc to guide your normalization process. 

This section will not be graded - think of it as your own scratch pad.

In [6]:
%%read_sql
-- #Use this section to explore the database by writing your own queries

SELECT Count (Distinct Barcode)
FROM Products

Query started at 10:33:37 AM South Africa Standard Time; Query executed in 0.00 m

   Count (Distinct Barcode)
0                       608

### 6. Normalize the given Database tables to the 1st Normal Form (1NF)

Given the below below target ERD create new tables such the the database conforms to the 1st Normal Form

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/1NF.png" alt="1st Normal Form ERD" border="0">

It is suggested that you create all your tables before attempting to populate them with data, this will help reduce errors that might creep up due to logical dependencies.

#### 6.1 Create the tables required for the 1st Normal Form
Use the above ERD sketch to create the required tables. Please label your tables as they appear in the ERD sketch

In [7]:
%%read_sql
--#Create tables required for 1NF

DROP TABLE IF EXISTS Transactions_1NF;
DROP TABLE IF EXISTS Products_1NF;


CREATE TABLE Products_1NF (
            Barcode VARCHAR(150) NOT NULL,
            NavigationPath VARCHAR(150) NOT NULL,
            ItemDescription VARCHAR(150) NOT NULL,
            ProductDescription VARCHAR(150) NOT NULL,
            Brand VARCHAR(150),
            Price REAL NOT NULL,
            Quantity INTEGER NOT NULL,
            PackType VARCHAR(150),
            Warranty VARCHAR(150),
            StockCountry VARCHAR(150),
            Colour VARCHAR(150),
            Weight_kg REAL,
            Volume_litre REAL,
            Length REAL,
            Width REAL,
            Height REAL,
            PRIMARY KEY (Barcode, NavigationPath, ItemDescription));


CREATE TABLE Transactions_1NF (
            CartID INTEGER NOT NULL,
            Barcode VARCHAR(150) NOT NULL,
            UserName VARCHAR(150) NOT NULL,
            InvoiceDate DATETIME NOT NULL,
            Total REAL NOT NULL,
            PRIMARY KEY (CartID, Barcode));

Query started at 10:33:45 AM South Africa Standard Time; Query executed in 0.00 m

#### 6.2 Populate the tables you have create in the above section.

Populate the tables such that the database conforms to the 1st Normal Form

In [8]:
%%read_sql
--#Populate the 1NF tables

 --INSERT INTO Products_1NF (Barcode, NavigationPath, ItemDescription, ProductDescription, Brand, Price, Quantity, PackType, Warranty, StockCountry, Colour, Weight_kg, Volume_litre, Length, Width, Height)
  
  INSERT INTO Products_1NF(Barcode, NavigationPath, ItemDescription, ProductDescription, Brand, Price, Quantity, PackType, Warranty, StockCountry, Colour, Weight_kg, Volume_litre, Length, Width, Height)
  SELECT Distinct Barcode, NavigationPath, ItemDescription, ProductDescription, Brand, Price, Quantity, PackType, Warranty, StockCountry, Colour, Weight_kg, Volume_litre, Length, Width, Height
  FROM Products
  ORDER BY BarCode;
  
  INSERT INTO Transactions_1NF (CartID, Barcode, UserName, InvoiceDate, Total)
  SELECT DISTINCT CartID, Barcode, UserName, InvoiceDate, Total
  FROM Transactions
  ORDER BY CartID;

Query started at 10:33:50 AM South Africa Standard Time; Query executed in 0.00 m

In [9]:
%%read_sql


SELECT count(Distinct Products_1NF.Barcode)
From Products_1NF

Query started at 10:33:55 AM South Africa Standard Time; Query executed in 0.00 m

   count(Distinct Products_1NF.Barcode)
0                                   608

In [10]:
%%read_sql

DROP TABLE Products;
DROP TABLE Transactions;

Query started at 10:34:06 AM South Africa Standard Time; Query executed in 0.00 m

In [ ]:
%%read_sql

-- REFER TO NOTEBOOK 2NFTABLES AND 3NFTABLES FOR 2NF AND 3NF NOMALIZATION RESPECTIVELY

###  7. Convert the database into its 2nd Normal Form (2NF).

Please label your tables as they appear in the ERD sketch.

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/2NF.png" alt="2nd Normal Form ERD" border="0">

In [ ]:
%%read_sql

-- REFER TO NOTEBOOK 2NFTABLES AND 3NFTABLES FOR 2NF AND 3NF NOMALIZATION RESPECTIVELY

<a id='Target_ERD'></a>
### 8. Convert the table into its 3rd Normal Form (3NF)

Please label your tables as they appear in the ERD sketch

<br>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/SQL4DS/SQL_Predict/3NF.png" alt="3rd Normal Form ERD" border="0"></a>

In [ ]:
%%read_sql

-- REFER TO NOTEBOOK 2NFTABLES AND 3NFTABLES FOR 2NF AND 3NF NOMALIZATION RESPECTIVELY

<a id='MCQ_questions'></a>
## 9. MCQ Questions

Having completed the normalisation of the database, you may use the following cells to help you answer the MCQs for the predict.

Q1) How many unique products does the company have?

In [25]:
%%read_sql
-- Write your query here:

SELECT COUNT (DISTINCT BarCode)
FROM Products_3NF
WHERE Barcode != ''

Query started at 10:53:23 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT (DISTINCT BarCode)
0                       608

Q2) How many users bought from Bhejane in April 2020?

In [132]:
%%read_sql
-- Write your query here:

SELECT Count(DISTINCT UserID)
FROM Transactions_3NF
WHERE InvoiceDate LIKE '2020-04%'

Query started at 05:57:27 PM South Africa Standard Time; Query executed in 0.00 m

   Count(DISTINCT UserID)
0                      31

Q3) How many users bought three or more items whose combined total was more than R1000 in a single transaction?

In [28]:
%%read_sql

-- Write your query here:

SELECT Username, InvoiceDate, Total
FROM Users_3NF
INNER JOIN Transactions_3NF ON Transactions_3NF.UserID = Users_3NF.UserID
GROUP BY Username, InvoiceDate
Having COUNT (UserName) >= 3 AND Total > 1000
ORDER BY Username

Query started at 10:55:44 AM South Africa Standard Time; Query executed in 0.00 m

    UserName         InvoiceDate   Total
0      Adele  2020-06-27 0:00:00  1177.0
1     DIMPHO  2020-07-02 0:00:00  1523.0
2      Daffy  2020-04-17 0:00:00  1134.0
3      Hanno  2020-06-09 0:00:00  1334.0
4     Junaid  2020-08-04 0:00:00  3301.0
5      Karyn  2020-05-31 0:00:00  1137.0
6     Mandla  2020-06-07 0:00:00  1351.0
7   Margaret  2020-06-13 0:00:00  1716.0
8        Mel  2020-07-24 0:00:00  1114.0
9    Melandi  2020-08-11 0:00:00  2535.0
10    Zanele  2020-04-04 0:00:00  3464.0

Q4) Which user(s) made the largest purchase on a sinlge transaction?

In [133]:
%%read_sql
-- Write your query here
SELECT Username,InvoiceDate, Barcode, Total
FROM Users_3NF
INNER JOIN Transactions_3NF ON Transactions_3NF.UserID = Users_3NF.UserID
GROUP BY Username, InvoiceDate
ORDER BY Total DESC

Query started at 05:59:24 PM South Africa Standard Time; Query executed in 0.00 m

          UserName         InvoiceDate        Barcode    Total
0         Brigette  2020-05-30 0:00:00    HTB5ABG31E3  10999.0
1           Mandla  2020-04-11 0:00:00    HTB5ABG31E3  10999.0
2    Andreas Peter  2020-03-27 0:00:00    HTB5FI3BC8C   3765.0
3          Mzoxolo  2020-08-12 0:00:00    HTB5FI3BC8C   3765.0
4           Zanele  2020-04-04 0:00:00   617566827837   3464.0
..             ...                 ...            ...      ...
186          Wayne  2020-08-10 0:00:00  6001865825405     23.0
187         Janine  2020-05-08 0:00:00  6002292008348     13.0
188          Cindy  2020-07-01 0:00:00  6006485007460     12.0
189       Michelle  2020-05-17 0:00:00  8714574600109     10.0
190         Ridhaa  2020-04-21 0:00:00  6001651090130      1.0

[191 rows x 4 columns]

Q5) How many components does the product: "5m Colour Changing RGB LED Strip Light" (MPTAL57588104) come with?

In [45]:
%%read_sql
-- Write your query here
 SELECT Count(DISTINCT ItemDescription),Barcode,ProductDescription
 FROM Products_3NF
 INNER JOIN PackageContents_3NF ON PackageContents_3NF.ItemID = Products_3NF.ItemID
 WHERE Barcode = 'MPTAL57588104'

Query started at 02:01:38 PM South Africa Standard Time; Query executed in 0.00 m

,Count(DISTINCT ItemDescription),Barcode,ProductDescription
0,4,MPTAL57588104,5m Colour Changing RGB LED Strip Light

Q6) How many brands are available at Bhejane?

In [29]:
%%read_sql
-- Write your query here:

SELECT COUNT(DISTINCT Brand) 
FROM Brands_3NF
WHERE Brand != ''

Query started at 10:57:16 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(DISTINCT Brand)
0                    232

7) What is the price of the "Verimark - Floorwiz 2in1 Mop"?

In [48]:
%%read_sql
-- Write your query here:
SELECT BarCode, ProductDescription, Price
FROM Products_3NF
WHERE ProductDescription = "Verimark - Floorwiz 2in1 Mop"

Query started at 03:32:53 PM South Africa Standard Time; Query executed in 0.00 m

         Barcode            ProductDescription  Price
0  6005427110503  Verimark - Floorwiz 2in1 Mop  179.0
1  6005427110503  Verimark - Floorwiz 2in1 Mop  179.0
2  6005427110503  Verimark - Floorwiz 2in1 Mop  179.0

Q8) Calculate the package volume of the "Russell Hobbs - Slow Cooker" using the given dimensions. Round your answer to the nearest integer and ignore units for the calculation.

In [53]:
%%read_sql
-- Write your query here:

SELECT DISTINCT Barcode, ProductDescription, Length*Width*Height AS Volume
FROM Products_3NF
WHERE ProductDescription =  "Russell Hobbs - Slow Cooker"

Query started at 03:40:24 PM South Africa Standard Time; Query executed in 0.00 m

         Barcode           ProductDescription   Volume
0  6002322013823  Russell Hobbs - Slow Cooker  26928.0

Q9) Which user made the most transactions in the Year 2020?

In [59]:
%%read_sql
-- Write your query here:
SELECT UserName, COUNT(CartID) 
FROM Users_3NF
INNER JOIN Transactions_3NF ON Transactions_3NF.UserID = Users_3NF.UserID
GROUP BY UserName
ORDER BY COUNT(CartID) DESC

Query started at 03:48:32 PM South Africa Standard Time; Query executed in 0.00 m

               UserName  COUNT(CartID)
0              Cornelis              9
1                  Erlo              8
2                Zanele              6
3               Heather              6
4                Mandla              5
..                  ...            ...
155  Angelica Fernandez              1
156             Andiswa              1
157   Andisa Moleboheng              1
158              Alicia              1
159             Adeebah              1

[160 rows x 2 columns]

Q10) What is the total number of recorded users that shop at Bhejane?

In [30]:
%%read_sql
-- Write your query here:

SELECT Count (DISTINCT UserID)
FROM Transactions_3NF
WHERE InvoiceDate != '' AND Total != ''

Query started at 10:59:38 AM South Africa Standard Time; Query executed in 0.00 m

   Count (DISTINCT UserID)
0                      160

Q11) What is the record count for the Colours_3NF Table?

In [32]:
%%read_sql
-- Write your query here:
SELECT  COUNT(DISTINCT Colour)
FROM Colours_3NF

Query started at 11:00:35 AM South Africa Standard Time; Query executed in 0.00 m

   COUNT(DISTINCT Colour)
0                      17

Q12) What would the total price be if I had the following items in my cart?
* MPTAL57588104
* 5000394203921
* 6932391917652

In [80]:
%%read_sql
-- Write your query here
SELECT 
((SELECT DISTINCT Price
FROM Products_3NF
WHERE Barcode = 'MPTAL57588104') +

(SELECT DISTINCT Price
FROM Products_3NF
WHERE Barcode = '5000394203921') +

(SELECT DISTINCT Price
FROM Products_3NF
WHERE Barcode = '6932391917652'))

FROM Products_3NF
LIMIT 1

Query started at 04:12:51 PM South Africa Standard Time; Query executed in 0.00 m

   ((SELECT DISTINCT Price\nFROM Products_3NF\nWHERE Barcode = 'MPTAL57588104') +\n\n(SELECT DISTINCT Price\nFROM Products_3NF\nWHERE Barcode = '5000394203921') +\n\n(SELECT DISTINCT Price\nFROM Products_3NF\nWHERE Barcode = '6932391917652'))
0                                              734.0

Q13) What is the barcode of the most sold product?

In [136]:
%%read_sql

-- Write your query here
SELECT Count(Barcode), Barcode
FROM Transactions_3NF
GROUP BY Barcode
Order BY Count(Barcode) DESC

Query started at 06:05:40 PM South Africa Standard Time; Query executed in 0.00 m

     Count(Barcode)           Barcode
0                 4     4015400541813
1                 3     MPTAL00404857
2                 3  HURACANNANOWAVE1
3                 3     6009686620537
4                 3     6001865825405
..              ...               ...
218               1     5000394020146
219               1     4902505163104
220               1       43859499182
221               1     4210201043577
222               1         300507946

[223 rows x 2 columns]

Q14) What are the products of Cornelisâ cart on the 2020-06-28 0:00:00?

In [89]:
%%read_sql

-- Write your query here:
SELECT Transactions_3NF.UserID, UserName, Transactions_3NF.BarCode, InvoiceDate, ProductDescription
FROM Transactions_3NF
INNER JOIN Users_3NF ON Transactions_3NF.UserID = Users_3NF.UserID
INNER JOIN Products_3NF ON Products_3NF.Barcode = Transactions_3NF. Barcode
WHERE Username = 'Cornelis' AND InvoiceDate = '2020-06-28 0:00:00'

Query started at 04:26:48 PM South Africa Standard Time; Query executed in 0.00 m

,UserID,UserName,Barcode,InvoiceDate,ProductDescription
0,10,Cornelis,6001106124069,2020-06-28 0:00:00,Dettol Body Wash - Shower Gel - Original - 600ml
1,10,Cornelis,6003753002035AP,2020-06-28 0:00:00,Vitality Aloe Vera Gel 100ml
2,10,Cornelis,6003753002035AP,2020-06-28 0:00:00,Vitality Aloe Vera Gel 100ml
3,10,Cornelis,6003753002035AP,2020-06-28 0:00:00,Vitality Aloe Vera Gel 100ml
4,10,Cornelis,MPTAL00555756,2020-06-28 0:00:00,Sparq Active Resistance Loop Band - Set of 5 w...
5,10,Cornelis,MPTAL00555756,2020-06-28 0:00:00,Sparq Active Resistance Loop Band - Set of 5 w...
6,10,Cornelis,MPTAL72193414,2020-06-28 0:00:00,Protective Face Shield
7,10,Cornelis,MPTAL72193414,2020-06-28 0:00:00,Protective Face Shield

Q15) Which users bought locally produced, black-coloured products on odd-numbered months of the year, and what was the total cost (rounded to the nearest integer) of these products?

In [129]:
%%read_sql

--Write your query here

SELECT DISTINCT UserID,Transactions_3NF.BarCode, InvoiceDate, SUM() Price, Colour, StockCountry, Total
FROM Products_3NF
INNER JOIN Transactions_3NF ON Transactions_3NF.Barcode = Products_3NF.Barcode
INNER JOIN Colours_3NF ON Colours_3NF.ColourID = Products_3NF.ColourID
INNER JOIN Locations_3NF ON Locations_3NF.LocationID = Products_3NF.LocationID
WHERE (Colour = 'Black' AND StockCountry = 'South Africa') AND (InvoiceDate LIKE '2020-01%' OR InvoiceDate LIKE '2020-03%' OR InvoiceDate LIKE '2020-05%' OR InvoiceDate LIKE '2020-07%' OR InvoiceDate LIKE '2020-09%' OR InvoiceDate LIKE '2020-11%')
Order By UserID

Query started at 05:50:32 PM South Africa Standard Time; Query executed in 0.00 m

,UserID,Barcode,InvoiceDate,Price,Colour,StockCountry,Total
0,7,741311301174,2020-03-31 0:00:00,1999.0,Black,South Africa,1999.0
1,16,6941428152961,2020-05-18 0:00:00,798.0,Black,South Africa,798.0
2,17,5000394020146,2020-07-04 0:00:00,189.0,Black,South Africa,189.0
3,28,6001246636682,2020-07-26 0:00:00,93.0,Black,South Africa,93.0
4,71,6925281939952,2020-05-04 0:00:00,799.0,Black,South Africa,799.0
5,75,7290012291685,2020-07-28 0:00:00,179.0,Black,South Africa,179.0
6,89,MPTAL00215561,2020-07-02 0:00:00,186.0,Black,South Africa,1523.0

In [131]:
%%read_sql

SELECT UserID, UserName
FROM Users_3NF
WHERE UserID IN (7,16,17,28,71,75,89)

Query started at 05:52:28 PM South Africa Standard Time; Query executed in 0.00 m

   UserID UserName
0       7    Cindy
1      16    Lacin
2      17   Hester
3      28   Conrad
4      71    Carel
5      75  Jeandre
6      89   DIMPHO